<?php

return [
    'root' => 'Root',
    
    /*
        |--------------------------------------------------------------------------
        | Buttons
        |--------------------------------------------------------------------------
    */
    'button.save' => '保存',
    'button.expand_all' => '展開',
    'button.collapse_all' => '折りたたむ',

    /*
        |--------------------------------------------------------------------------
        | Form
        |--------------------------------------------------------------------------
    */
    'components.tree.buttons.select_all.label' => 'すべて選択',
    'components.tree.buttons.deselect_all.label' => '選択解除',
    'components.tree.buttons.expand_all.label' => '展開',
    'components.tree.buttons.collapse_all.label' => '折りたたむ',
    
    /*
        |--------------------------------------------------------------------------
        | Message
        |--------------------------------------------------------------------------
    */
    'actions.delete.confirmation.with_children' => 'このレコードとその子レコードを削除してもよろしいですか？',
];