<?php

return [
    'root' => 'ルート',

    /*
        |--------------------------------------------------------------------------
        | Buttons
        |--------------------------------------------------------------------------
    */
    'button.save' => '保存',
    'button.expand_all' => 'すべて展開',
    'button.collapse_all' => 'すべて折りたたむ',

    /*
        |--------------------------------------------------------------------------
        | Form
        |--------------------------------------------------------------------------
    */
    'components.tree.buttons.select_all.label' => 'すべて選択',
    'components.tree.buttons.deselect_all.label' => '選択解除',
    'components.tree.buttons.expand_all.label' => 'すべて展開',
    'components.tree.buttons.collapse_all.label' => 'すべて折りたたむ',

    /*
        |--------------------------------------------------------------------------
        | Message
        |--------------------------------------------------------------------------
    */
    'actions.delete.confirmation.with_children' => 'このレコードとその子レコードを削除してもよろしいですか？',

    'parent_node' => '親項目',
    'item_moved' => '項目を移動しました',
    'descendant_error' => '項目をその子孫に移動することはできません',
    'fix_tree' => 'ツリーを修復',
    'tree_fixed' => 'ツリーを修復しました',
    'empty_tree' => 'ツリーは空です。最初の項目を作成してください。',
];